{
  "projects": [
    {
      "name": "About Me Page",
      "sections": [
        {
          "name": "Overview",
          "subsections": [
            {
              "title": "Tech Stack",
              "paragraphs": [
                {
                  "type": "text",
                  "text": "This web page has been designed to serve as an interactive demonstration of my frontend web development expertise. I firmly uphold the belief that a tangible, real-life project is the most compelling testament to one's capabilities, and this online portfolio embodies that conviction."
                },
                {
                  "type": "text",
                  "text": "At its core, this project is built on the latest iteration of the Angular framework, specifically version 16. Angular, renowned for its versatility and robust features, provides a strong foundation for the integration of interactive elements and the creation of a user experience that is both seamless and engaging."
                },
                {
                  "type": "text",
                  "text": "To enhance the visual aesthetics and user experience, I opted for the utilization of SCSS (Sass), a powerful CSS preprocessor. Moreover, the implementation of Angular animations elevates the user experience by introducing fluidity and dynamism to the website."
                },
                {
                  "type": "text",
                  "text": "Furthermore, this project underscores my commitment to best practices in web development by embracing static typing through TypeScript. This decision is driven by the goal of reducing the occurrence of common type-related errors, ultimately enhancing the maintainability and stability of the codebase. In doing so, I prioritize the long-term performance and functionality of this online portfolio."
                },
                {
                  "type": "component",
                  "htmlTag": "app-web-technologies"
                }
              ]
            },
            {
              "title": "Tools",
              "paragraphs": [
                {
                  "type": "text",
                  "text": "Drawing from my familiarity with Visual Studio Code, I employed it as the primary source code editor throughout the development of this project. It's a tool I've honed my skills with, enabling me to work efficiently and maintain a high standard of code quality."
                },
                {
                  "type": "text",
                  "text": "In the spirit of good development practices, I recognized the importance of implementing version control, even in a solo project. As such, I chose the industry-standard version control system, 'git.'"
                },
                {
                  "type": "text",
                  "text": "In the spirit of good development practices, I recognized the importance of implementing version control, even in a solo project. As such, I chose the industry-standard version control system, 'git.' For those interested in delving deeper into the technical aspects of this project, I've made the full source code available on my GitHub repository, which can be accessed here: <a href='https://github.com/MarekOchocki/AboutMe' target='_blank'>About Me Page Repository</a>."
                }
              ]
            }
          ]
        },
        {
          "name": "Features",
          "subsections": [
            {
              "title": "Routing",
              "paragraphs": [
                {
                  "type": "text",
                  "text": "One of the features of this webpage is the implementation of a routing system. With this routing in place when you copy and share a link to a particular section, the content automatically adjusts, ensuring that the chosen section is displayed. This simplifies the sharing of content but also enhances the overall user experience."
                },
                {
                  "type": "video",
                  "videoUrl": "./assets/video/routing.mp4"
                }
              ]
            },
            {
              "title": "Animations and Transitions",
              "paragraphs": [
                {
                  "type": "text",
                  "text": "The use of subtle animations and transitions is intended to create a more seamless and enjoyable journey through the content. Instead of abrupt changes, the content gracefully fades in and out, making the transitions more user-friendly. They offer you the time to easily grasp and appreciate the changes as you explore the various sections of the page."
                }
              ]
            },
            {
              "title": "Content as Json Asset",
              "paragraphs": [
                {
                  "type": "text",
                  "text": "Behind the scenes, I've structured the content using a JSON file with a specific format, allowing me to shape and customize it easily. Each section can contain multiple paragraphs, and these paragraphs can be of various types, such as text, video, image, or custom component. This separation of content from the underlying HTML and CSS makes editing and updating the website a straightforward process. Not only does this approach improve the ease of content management, but it also lays the foundation for potential future features, like dynamic language changes."
                },
                {
                  "type": "video",
                  "videoUrl": "./assets/video/json_content.mp4"
                }
              ]
            },
            {
              "title": "Dynamic Angular Components",
              "paragraphs": [
                {
                  "type": "text",
                  "text": "In addition to the flexibility offered by various paragraph types, I've taken it a step further by introducing the concept of 'custom components.' This feature allows for virtually unlimited content possibilities. When the predefined paragraph types don't quite fit the vision for a particular section, I have the ability to create new Angular components and seamlessly integrate them into the webpage."
                },
                {
                  "type": "text",
                  "text": "This means that if a unique content element is needed, I can design a new Angular component and include it in the list of available components for embedding. Once added, this component can be inserted into the JSON file at any desired location or quantity. The webpage will automatically recognize and inject it precisely where it's needed, providing a tailored and dynamic user experience."
                },
                {
                  "type": "text",
                  "text": "One of such places is located in the 'overview' section of this project. The tech stack logo display had to be a custom component as it is made out of two rows of small images that would not present themselves aestetically in standard format."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Factorio Calculator",
      "sections": [
        {
          "name": "Overview",
          "subsections": []
        },
        {
          "name": "Features",
          "subsections": []
        },
        {
          "name": "Try it",
          "subsections": [
            {
              "title": "Factorio Calculator",
              "paragraphs": [
                {
                  "type": "component",
                  "htmlTag": "app-factorio-paragraph"
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}